GNU gdb (Ubuntu 9.2-0ubuntu1~20.04.1) 9.2
Copyright (C) 2020 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from explicitMatrix...
(gdb) b 3393 if totalTimeSteps>466
Breakpoint 1 at 0xee4b: file explicitMatrix.cpp, line 3393.
(gdb) r
Starting program: /home/jared/Thermo-nuclear-network/explicitMatrix/explicitMatrix 

Wed Jun  8 11:56:28 2022


Integration using QSS+PE method
T9=7.000e+00 rho=1.000e+08 massTol=1.000e-07 sf=1.00e+25 equiTol=1.00e-02 equilTime=1.00e-13
maxit=20 downbumper= 0.700 EpsA=1.00e-03 EpsR=2.00e-04
Network: data/network_alpha.inp  Rates: data/rateLibrary_alpha.data
Integration steps=0  totalIterations=0  IntegrationSteps_plotted=0
Timer: 6.2400e+00 ms used

BEGIN TIME INTEGRATION:

1 it=0 t=1.63e-18 dt=1.63e-19 int=57 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.69e+10 E_R=3.33e-13 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
2 it=0 t=2.63e-18 dt=2.63e-19 int=62 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=4.34e+10 E_R=7.77e-13 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
3 it=0 t=4.24e-18 dt=4.24e-19 int=67 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=6.99e+10 E_R=2.00e-12 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
4 it=0 t=6.82e-18 dt=6.82e-19 int=72 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.13e+11 E_R=5.33e-12 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
5 it=0 t=1.10e-17 dt=1.10e-18 int=77 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.82e+11 E_R=1.39e-11 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
6 it=0 t=1.61e-17 dt=1.61e-18 int=81 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.66e+11 E_R=2.96e-11 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
7 it=0 t=2.59e-17 dt=2.59e-18 int=86 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=4.29e+11 E_R=7.68e-11 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
8 it=0 t=4.17e-17 dt=4.17e-18 int=91 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=6.90e+11 E_R=1.99e-10 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
9 it=0 t=6.72e-17 dt=6.72e-18 int=96 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.11e+12 E_R=5.17e-10 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
10 it=0 t=1.08e-16 dt=1.08e-17 int=101 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.79e+12 E_R=1.34e-09 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
11 it=0 t=1.74e-16 dt=1.74e-17 int=106 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.88e+12 E_R=3.48e-09 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
12 it=0 t=2.55e-16 dt=2.55e-17 int=110 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=4.22e+12 E_R=7.45e-09 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
13 it=0 t=4.11e-16 dt=4.11e-17 int=115 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=6.80e+12 E_R=1.93e-08 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
14 it=0 t=6.62e-16 dt=6.62e-17 int=120 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.10e+13 E_R=5.01e-08 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
15 it=0 t=1.07e-15 dt=1.07e-16 int=125 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.76e+13 E_R=1.30e-07 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
16 it=0 t=1.72e-15 dt=1.72e-16 int=130 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.84e+13 E_R=3.37e-07 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
17 it=0 t=2.51e-15 dt=2.51e-16 int=134 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=4.16e+13 E_R=7.21e-07 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
18 it=0 t=4.05e-15 dt=4.05e-16 int=139 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=6.69e+13 E_R=1.87e-06 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
19 it=0 t=6.52e-15 dt=6.52e-16 int=144 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.08e+14 E_R=4.83e-06 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
20 it=0 t=1.05e-14 dt=1.05e-15 int=149 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.64e+28 E=1.73e+14 E_R=1.25e-05 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
21 it=0 t=1.69e-14 dt=1.69e-15 int=154 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.64e+28 E=2.78e+14 E_R=3.22e-05 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
22 it=0 t=2.72e-14 dt=2.72e-15 int=159 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.62e+28 E=4.46e+14 E_R=8.25e-05 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
23 it=0 t=3.99e-14 dt=3.99e-15 int=163 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.61e+28 E=6.51e+14 E_R=1.75e-04 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
24 it=0 t=6.42e-14 dt=6.42e-15 int=168 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.58e+28 E=1.04e+15 E_R=4.42e-04 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
25 it=0 t=1.03e-13 dt=1.03e-14 int=173 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.54e+28 E=1.65e+15 E_R=1.10e-03 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
26 it=0 t=1.67e-13 dt=1.67e-14 int=178 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.48e+28 E=2.60e+15 E_R=2.68e-03 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
27 it=0 t=2.68e-13 dt=2.68e-14 int=183 Asy=0/16 Eq=0/19 SX=1.0001 dE=1.39e+28 E=4.05e+15 E_R=6.30e-03 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
28 it=0 t=4.32e-13 dt=4.32e-14 int=188 Asy=0/16 Eq=0/19 SX=1.0001 dE=1.25e+28 E=6.18e+15 E_R=1.40e-02 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
29 it=0 t=6.33e-13 dt=6.33e-14 int=192 Asy=0/16 Eq=0/19 SX=1.0003 dE=1.11e+28 E=8.52e+15 E_R=2.52e-02 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
30 it=0 t=1.02e-12 dt=1.02e-13 int=197 Asy=0/16 Eq=0/19 SX=1.0005 dE=9.01e+27 E=1.23e+16 E_R=4.78e-02 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
31 it=0 t=1.64e-12 dt=1.64e-13 int=202 Asy=0/16 Eq=0/19 SX=1.0010 dE=6.62e+27 E=1.70e+16 E_R=7.97e-02 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
32 it=0 t=2.64e-12 dt=2.64e-13 int=207 Asy=0/16 Eq=0/19 SX=1.0018 dE=4.30e+27 E=2.21e+16 E_R=1.14e-01 ch=0 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
33 it=0 t=4.26e-12 dt=4.26e-13 int=212 Asy=0/16 Eq=0/19 SX=1.0028 dE=2.35e+27 E=2.70e+16 E_R=1.39e-01 ch=0 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
34 it=0 t=6.85e-12 dt=6.85e-13 int=217 Asy=0/16 Eq=0/19 SX=1.0039 dE=9.88e+26 E=3.07e+16 E_R=1.52e-01 ch=0 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
35 it=0 t=1.00e-11 dt=1.00e-12 int=221 Asy=0/16 Eq=0/19 SX=1.0049 dE=3.12e+26 E=3.24e+16 E_R=1.63e-01 ch=0 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
36 it=0 t=1.62e-11 dt=1.62e-12 int=226 Asy=0/16 Eq=0/19 SX=1.0063 dE=-1.10e+26 E=3.24e+16 E_R=2.05e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
37 it=0 t=2.60e-11 dt=2.60e-12 int=231 Asy=0/16 Eq=0/19 SX=1.0083 dE=-2.10e+26 E=3.05e+16 E_R=3.12e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
38 it=0 t=4.19e-11 dt=4.19e-12 int=236 Asy=0/16 Eq=0/19 SX=1.0113 dE=-1.37e+26 E=2.78e+16 E_R=4.69e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
39 it=0 t=6.75e-11 dt=6.75e-12 int=241 Asy=0/16 Eq=0/19 SX=1.0154 dE=-2.01e+25 E=2.62e+16 E_R=5.52e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
40 it=0 t=1.09e-10 dt=1.09e-11 int=246 Asy=0/16 Eq=0/19 SX=1.0191 dE=5.99e+25 E=2.77e+16 E_R=4.23e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
41 it=0 t=1.59e-10 dt=1.59e-11 int=250 Asy=0/16 Eq=0/19 SX=1.0210 dE=8.58e+25 E=3.17e+16 E_R=2.25e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
42 it=0 t=2.56e-10 dt=2.56e-11 int=255 Asy=0/16 Eq=0/19 SX=1.0218 dE=9.17e+25 E=4.05e+16 E_R=2.89e-02 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
43 it=0 t=4.13e-10 dt=4.13e-11 int=260 Asy=0/16 Eq=0/19 SX=1.0215 dE=8.51e+25 E=5.43e+16 E_R=9.33e-02 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
44 it=0 t=6.65e-10 dt=6.65e-11 int=265 Asy=1/16 Eq=0/19 SX=1.0202 dE=6.97e+25 E=7.34e+16 E_R=2.55e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
45 it=0 t=1.07e-09 dt=1.07e-10 int=270 Asy=2/16 Eq=0/19 SX=1.0174 dE=4.88e+25 E=9.64e+16 E_R=4.84e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
46 it=0 t=1.72e-09 dt=1.72e-10 int=275 Asy=2/16 Eq=0/19 SX=1.0132 dE=2.89e+25 E=1.20e+17 E_R=6.96e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
47 it=0 t=2.53e-09 dt=2.53e-10 int=279 Asy=2/16 Eq=0/19 SX=1.0092 dE=1.69e+25 E=1.36e+17 E_R=7.54e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
48 it=0 t=4.07e-09 dt=4.07e-10 int=284 Asy=3/16 Eq=0/19 SX=1.0044 dE=7.58e+24 E=1.53e+17 E_R=5.96e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
49 it=0 t=6.59e-09 dt=5.25e-10 int=290 Asy=3/16 Eq=1/19 SX=1.0000 dE=1.40e+24 E=1.61e+17 E_R=7.12e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+1.451e-01
50 it=0 t=1.09e-08 dt=1.09e-09 int=296 Asy=5/16 Eq=1/19 SX=1.0000 dE=2.51e+23 E=1.63e+17 E_R=7.51e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+2.884e-01
51 it=0 t=1.59e-08 dt=1.59e-09 int=300 Asy=6/16 Eq=2/19 SX=1.0000 dE=-1.96e+23 E=1.63e+17 E_R=3.02e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+3.932e-02
52 it=0 t=2.56e-08 dt=2.56e-09 int=305 Asy=5/16 Eq=5/19 SX=1.0000 dE=-2.85e+23 E=1.60e+17 E_R=4.60e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+1.496e-01
53 it=0 t=4.12e-08 dt=4.12e-09 int=310 Asy=5/16 Eq=5/19 SX=1.0000 dE=-1.60e+23 E=1.57e+17 E_R=5.04e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+3.083e-01
54 it=0 t=6.43e-08 dt=1.35e-09 int=317 Asy=7/16 Eq=1/19 SX=1.0000 dE=-1.81e+25 E=8.61e+16 E_R=2.58e+02 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+3.358e-01
55 it=0 t=1.00e-07 dt=2.25e-09 int=351 Asy=4/16 Eq=3/19 SX=1.0000 dE=-3.98e+23 E=-1.48e+17 E_R=2.00e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+2.742e-02
56 it=0 t=1.60e-07 dt=1.58e-09 int=391 Asy=4/16 Eq=4/19 SX=1.0000 dE=-4.28e+23 E=-2.11e+17 E_R=9.40e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+4.042e-01
57 it=0 t=2.59e-07 dt=2.03e-08 int=447 Asy=8/16 Eq=4/19 SX=1.0000 dE=-1.19e+23 E=-2.40e+17 E_R=2.30e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+1.814e-01
Breakpoint 1, Integrate::doIntegrationStep () at explicitMatrix.cpp:3393
3393	        static void doIntegrationStep(){
(gdb) watch dt 
Hardware watchpoint 2: dt
(gdb) watch t
Hardware watchpoint 3: t
(gdb) watch T[Ktotal [KTimeSteps
Hardware watchpoint 4: totalTimeSteps
(gdb) watch diffX
Hardware watchpoint 5: diffX
(gdb) c[Kn
3400	            double E_half1 = 0.0;
(gdb) 
3401	            double E_half2 = 0.0;
(gdb) 
3406	            dtLast = dt;
(gdb) 
3407	            sumX = Utilities::sumMassFractions();
(gdb) 
3408	            sumXlast = sumX;
(gdb) 
3409	            t_saved = t;
(gdb) 
3410	            dt_saved = dt;     // Will hold final dt in this timestep.
(gdb) 
3411	            storeCurrentY();
(gdb) 
3415	            dt_FE = sf/fastestCurrentRate;
(gdb) 
3419	            choice2 =  0;
(gdb) 
3420	            dtMode = 0;
(gdb) 
3423	            if (doASY == true){
(gdb) 
3428	            else if (doQSS == true){
(gdb) 
3429	                dt_QSS = computeTimeStep_QSS(dtLast, sumX);
(gdb) 
3430	                if(dt_QSS < dt_FE)choice2 = 1;
(gdb) 
3431	                dt = min(dt_FE, dt_QSS);
(gdb) 

Hardware watchpoint 2: dt

Old value = 3.3966369351434305e-10
New value = 1.8701235349427157e-153
Integrate::doIntegrationStep () at explicitMatrix.cpp:3438
3438	            storeCurrentY();
(gdb) 
3439	            dt_saved = dt;
(gdb) p dt_FE
$1 = 1.8701235349427157e-153
(gdb) p dt_QSS
$2 = 3.3966369351434305e-10
(gdb) 